In [1]:
# else function in for loop

def find(seq, target):
    """
    This to demonstrate the 'else' function in a for loop. 
    Using 'else' in for loop to do an action if there was
    no break found in the loop.

    """
    for i, value in enumerate(seq):
        if value == target:
            break
    else:
        return -1

    return i

## DICTIONARY AND DEFAULTDICT

In [3]:
# LOOPING OVER DICTIONARY KEYS AND DELETE KEYS WITH CRITERIA

d = {'a': 1, 'a3': 3, 'b': 4, 'r4':5}
# instead of looping over each keys and delete items
d = {k: d[k] for k in d if not k.startswith('r')}

d

{'a': 1, 'a3': 3, 'b': 4}

In [5]:
# COUNTING WITH DICTIONARY

from collections import defaultdict
colors = ['red', 'green', 'blue', 'blue', 'red', 'red']
d = {}

# First method
for color in colors:
    d[color] = d.get(color, 0) + 1

# Using default dict:
d = defaultdict(int)

for color in colors:
    d[color] += 1  # If color is not exists yet,
    
d

defaultdict(int, {'red': 3, 'green': 1, 'blue': 2})

In [ ]:
# GROUPING WITH DICTIONARY
colors = ['red', 'green', 'blue', 'blue', 'red', 'red']
d = defaultdict(list)
for color in colors:
    key = len(color)
    d[key].append(color)

In [6]:
# DICTIONARY POPITEM

# returns an arbitrary element (key, value) pair from the dictionary
# removes an arbitrary element (the same element which is returned) from the dictionary.

person = {'name': 'Phill', 'age': 22, 'salary': 3500.0}

result = person.popitem()
print('person = ', person)
print('Return Value = ', result)

person =  {'name': 'Phill', 'age': 22}
Return Value =  ('salary', 3500.0)

## DATE & TIME

In [ ]:
# CONVERT TIMESTAMP FROM UTC TO OTHER TIMEZONE 

def convert_time_from_utc(timestamp, to_time_zone='Australia/Melbourne', output_format=None):
    """
    Convert utc timestamp to other timestamp

    Args:
        timestamp: datetime object or string present datetime.
                    if the input is string it must follow 'YYYY-MM-DD HH:MM:SS'

        to_time_zone: to the desire timezone
        output_format: 'datetime' or string format of time
                    If set as None, then function return exactly the same type as input.

    Returns:
        datetime object or string presenting datetime in new time zone
    """

    if output_format is None:
        if type(timestamp) is str:
            output_format = 'str'
            timestamp = datetime.strptime(timestamp, '%Y-%m-%d %H:%M:%S')
        elif (type(timestamp) is datetime) or (type(timestamp) is datetime.datetime):
            output_format = 'datetime'
        else:
            raise ValueError(
                'input timestamp must either string YYYY-MM-DD HH:MM:SS or a datetime object')

    utc_tz = tz.gettz('UTC')
    to_tz = tz.gettz(to_time_zone)

    output = timestamp.replace(tzinfo=utc_tz)
    output = output.astimezone(to_tz)

    if output_format == 'datetime':
        return output
    elif output_format == 'str':
        return datetime.strftime(output, '%Y-%m-%d %H:%M:%S')
    else:
        return datetime.strftime(output, output_format)

### Timestamp

In [7]:
# EPOCH: timestamp from 1/1/1970
import time

time.time()

1565014626.918981

In [10]:
from datetime import datetime
dtnow = datetime.fromtimestamp(time.time())
dtnow

datetime.datetime(2019, 8, 6, 0, 18, 18, 455068)

In [13]:
dtnow.year, dtnow.month, dtnow.hour

(2019, 8, 0)

### UTC

In [15]:
# GET TODAY DATE IN UTC TIME ZONE
from datetime import datetime, timezone, timedelta

datetime.now(timezone.utc)

datetime.datetime(2019, 8, 5, 14, 19, 53, 799258, tzinfo=datetime.timezone.utc)

In [16]:
# 5 days before current time:
datetime.today() + timedelta(days=-5)

datetime.datetime(2019, 8, 1, 0, 20, 12, 154164)

## DATAFRAME

### Index

In [17]:
# SET MULTI-LEVEL INDEXING

import pandas as pd

purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

# Set multi-level index
df = df.set_index([df.index, 'Name'])

# Rename the index
df.index.names = ['Location', 'Name']

# Demonstrate adding record
df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0

In [20]:
df.loc['Store 1','Chris']

Item Purchased    Dog Food
Cost                  22.5
Name: (Store 1, Chris), dtype: object

### Index of Maximum value in a column

In [ ]:
df['col'].idxmax()

### Method Chaining

https://tomaugspurger.github.io/method-chaining.html

https://www.datacamp.com/community/tutorials/pandas-idiomatic

https://towardsdatascience.com/the-unreasonable-effectiveness-of-method-chaining-in-pandas-15c2109e3c69

<p>Method chaining, where you call methods on an object one after another, is in vogue at the moment.
It's always been a style of programming that's been possible with pandas,
and over the past several releases, we've added methods that enable even more chaining.</p>

<ul>
<li><a href="http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.assign.html">assign</a> (0.16.0): For adding new columns to a DataFrame in a chain (inspired by dplyr's <code>mutate</code>)</li>
<li><a href="http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.pipe.html">pipe</a> (0.16.2): For including user-defined methods in method chains.</li>
<li><a href="http://pandas.pydata.org/pandas-docs/version/0.18.0/whatsnew.html#changes-to-rename">rename</a> (0.18.0): For altering axis names (in additional to changing the actual labels as before).</li>
<li><a href="http://pandas.pydata.org/pandas-docs/version/0.18.0/whatsnew.html#window-functions-are-now-methods">Window methods</a> (0.18): Took the top-level <code>pd.rolling_*</code> and <code>pd.expanding_*</code> functions and made them <code>NDFrame</code> methods with a <code>groupby</code>-like API.</li>
<li><a href="http://pandas.pydata.org/pandas-docs/version/0.18.0/whatsnew.html#resample-api">Resample</a> (0.18.0) Added a new <code>groupby</code>-like API</li>
<li><a href="https://github.com/pydata/pandas/pull/12539">.where/mask/Indexers accept Callables</a> (0.18.1): In the next release you'll be able to pass a callable to the indexing methods, to be evaluated within the DataFrame's context (like <code>.query</code>, but with code instead of strings).</li>
</ul>
<p>My scripts will typically start off with large-ish chain at the start getting things into a manageable state.
It's good to have the bulk of your munging done with right away so you can start to do Science™:</p>

In [ ]:

(
census_df.query("SUMLEV ==50") # Get State level summary
         .sort_values(['CENSUS2010POP'], ascending = False) # Sort each county by population desc
         .groupby('STNAME') # Group by State name to get the top 3 counties
         .head(3)
         .groupby('STNAME') # Group by State name to get total population of each State by the top 3 counties
         .sum()
         .sort_values(['CENSUS2010POP'], ascending = False) # Order state by population
         .head(3)
         .index # Return the name of the states (as the index now)
)

In [ ]:
# For this example, note the `assign` function and `filter` function
# assign to create new column
# filter in this case to select specific columns

pop_cols = ['POPESTIMATE2010','POPESTIMATE2011','POPESTIMATE2012'
            ,'POPESTIMATE2013','POPESTIMATE2014','POPESTIMATE2015']
county = (census_df.query("SUMLEV ==50") # Filter for county summary
                 .set_index(['CTYNAME']) # Set county name as index
                 .filter(pop_cols) # Filter the dataframe to only population records
                 .assign(min_pop = lambda r: r.min(axis=1) # Calc min population column
                        ,max_pop = lambda r: r.max(axis=1))# Calc max population column
                 .assign(pop_change = lambda r: r['max_pop'] - r['min_pop'])
                 .filter(['pop_change'])
                 .idxmax()
            )[0]

### Apply

In [35]:
# This demonstrate the apply function for row wise calculation

import numpy as np
import seaborn as sns

df = sns.load_dataset('iris')

def min_max(row):
    data = row[['sepal_length', 'sepal_width']] 
    return pd.Series({'min':np.min(data), 'max':np.max(data)})

df.apply(min_max, axis=1).head() # Note the axis=1 for row

   min  max
0  3.5  5.1
1  3.0  4.9
2  3.2  4.7
3  3.1  4.6
4  3.6  5.0

### Groupby

In [42]:

# Loop with groupby:

df = sns.load_dataset('flights')
print(df.head())

for group, frame in df.groupby('year'):
    avg = np.average(frame['passengers'])
    print(f'{group} - average passenders num: {avg}')

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121
1949 - average passenders num: 126.66666666666667
1950 - average passenders num: 139.66666666666666
1951 - average passenders num: 170.16666666666666
1952 - average passenders num: 197.0
1953 - average passenders num: 225.0
1954 - average passenders num: 238.91666666666666
1955 - average passenders num: 284.0
1956 - average passenders num: 328.25
1957 - average passenders num: 368.4166666666667
1958 - average passenders num: 381.0
1959 - average passenders num: 428.3333333333333
1960 - average passenders num: 476.1666666666667

In [45]:
df.groupby('year').mean()

      passengers
year
1949  126.666667
1950  139.666667
1951  170.166667
1952  197.000000
1953  225.000000
1954  238.916667
1955  284.000000
1956  328.250000
1957  368.416667
1958  381.000000
1959  428.333333
1960  476.166667

In [79]:
# You can pass a function to groupby:
# Need example here

In [81]:
# Group by and aggregation function:


df = sns.load_dataset('flights')
df.groupby('year').agg({'passengers':np.sum})

      passengers
year
1949        1520
1950        1676
1951        2042
1952        2364
1953        2700
1954        2867
1955        3408
1956        3939
1957        4421
1958        4572
1959        5140
1960        5714

In [ ]:
#                        Category  Quantity  Weight (oz.)
# Item                                                   
# Pack                       Pack         1          33.0
# Tent                    Shelter         1          80.0
# Sleeping Pad              Sleep         1          27.0
# Sleeping Bag              Sleep         1          20.0
# Toothbrush/Toothpaste    Health         1           2.0
# Sunscreen                Health         1           5.0
# Medical Kit              Health         1           3.7
# Spoon                   Kitchen         1           0.7
# Stove                   Kitchen         1          20.0
# Water Filter            Kitchen         1           1.8
# Water Bottles           Kitchen         2          35.0
# Pack Liner              Utility         1           1.0
# Stuff Sack              Utility         1           1.0
# Trekking Poles          Utility         1          16.0
# Rain Poncho            Clothing         1           6.0
# Shoes                  Clothing         1          12.0
# Hat                    Clothing         1           2.5

df.groupby('Category').apply(lambda df,a,b: sum(df[a] * df[b]), 'Weight (oz.)', 'Quantity')

# First method:
# Your code here
df['total weight'] = df['Quantity'] * df['Weight (oz.)']

df.groupby('Category').agg({'total weight':np.sum})

# Second Method using lambda function:
df.groupby('Category').apply(lambda df,a,b: sum(df[a] * df[b]), 'Weight (oz.)', 'Quantity')

In [86]:
df = sns.load_dataset('diamonds')

# Group by using multiple aggregation on 1 column input. 
# This is series group by
(
    df.set_index('cut')
    .groupby(level=0)
    ['carat']
    .agg({'avg_carat':np.average, 'min_carat':np.mean})
)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  import sys

           avg_carat  min_carat
cut
Fair        1.046137   1.046137
Good        0.849185   0.849185
Ideal       0.702837   0.702837
Premium     0.891955   0.891955
Very Good   0.806381   0.806381

In [88]:
# Group by using multiple aggregation on 1 column input
# This is dataframe group by
(
    df.set_index('cut')
    .groupby(level=0)
    [['carat','price']]
    .agg({'avg':np.average, 'min':np.mean})
)

/anaconda3/lib/python3.7/site-packages/pandas/core/groupby/groupby.py:4656: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

                avg                    min
              carat        price     carat        price
cut
Fair       1.046137  4358.757764  1.046137  4358.757764
Good       0.849185  3928.864452  0.849185  3928.864452
Ideal      0.702837  3457.541970  0.702837  3457.541970
Premium    0.891955  4584.257704  0.891955  4584.257704
Very Good  0.806381  3981.759891  0.806381  3981.759891